---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArray.ForwardIterator
source: html/663d1a29-b38d-b3e6-e7f5-7b5e6a901713.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual SymbolicCurveArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.